{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "Sources": [
    {
      "Packages": [
        { "PackageIdentifier": "7zip.7zip" },
        { "PackageIdentifier": "Microsoft.PowerShell" },
        { "PackageIdentifier": "Microsoft.WindowsTerminal" },
        { "PackageIdentifier": "Microsoft.PowerToys" },
        { "PackageIdentifier": "Git.Git" },
        { "PackageIdentifier": "Microsoft.VisualStudioCode" },
        { "PackageIdentifier": "ZedIndustries.Zed" },
        { "PackageIdentifier": "Docker.DockerDesktop" },
        { "PackageIdentifier": "GoLang.Go" },
        { "PackageIdentifier": "Google.Chrome" },
        { "PackageIdentifier": "AgileBits.1Password" },
        { "PackageIdentifier": "AgileBits.1Password.CLI" },
        { "PackageIdentifier": "Anthropic.Claude" },
        { "PackageIdentifier": "Notion.Notion" },
        { "PackageIdentifier": "Obsidian.Obsidian" },
        { "PackageIdentifier": "SlackTechnologies.Slack" },
        { "PackageIdentifier": "Zoom.Zoom" },
        { "PackageIdentifier": "Discord.Discord" },
        { "PackageIdentifier": "Spotify.Spotify" },
        { "PackageIdentifier": "VideoLAN.VLC" },
        { "PackageIdentifier": "OBSProject.OBSStudio" },
        { "PackageIdentifier": "Tailscale.Tailscale" },
        { "PackageIdentifier": "Starship.Starship" },
        { "PackageIdentifier": "AutoHotkey.AutoHotkey" },
        { "PackageIdentifier": "AntibodySoftware.WizTree" },
        { "PackageIdentifier": "FilesCommunity.Files" },
        { "PackageIdentifier": "voidtools.Everything" },
        { "PackageIdentifier": "Ditto.Ditto" },
        { "PackageIdentifier": "ShareX.ShareX" },
        { "PackageIdentifier": "xanderfrangos.twinkletray" },
        { "PackageIdentifier": "TrackerSoftware.PDF-XChangeEditor" },
        { "PackageIdentifier": "SumatraPDF.SumatraPDF" },
        { "PackageIdentifier": "REALiX.HWiNFO" },
        { "PackageIdentifier": "DevToys-app.DevToys" },
        { "PackageIdentifier": "File-New-Project.EarTrumpet" }
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ]
}
